Reports/РасшифровкаПлатежейВБюджет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Report>
		<Properties>
			<Name>РасшифровкаПлатежейВБюджет</Name>
			<Comment>Расшифровка платежей в бюджет</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимРасшифровки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

AccountingRegisters/Хозрасчетный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<AccountingRegister>
		<Properties>
			<Name>Хозрасчетный</Name>
			<ChartOfAccounts>ChartOfAccounts.Хозрасчетный</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.УчетПоПодразделениям</AccountingFlag>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Валютный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Количественный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Количественный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеКорректироватьСтоимостьАвтоматически</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

InformationRegisters/ДанныеПервичныхДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>ДанныеПервичныхДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРегистратора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерРегистратора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.АР_ДополнительноеСоглашение</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетПроизводстваЗаСмену</v8:Type>
						<v8:Type>cfg:DocumentRef.ФормированиеЗаписейКнигиПокупок</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеОС</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтражениеЗарплатыВБухучете</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеСРасчетногоСчета</v8:Type>
						<v8:Type>cfg:DocumentRef.АктОРасхожденияхПолученный</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаОС</v8:Type>
						<v8:Type>cfg:DocumentRef.СправкиНДФЛДляПередачиВНалоговыйОрган</v8:Type>
						<v8:Type>cfg:DocumentRef.АктОРасхождениях</v8:Type>
						<v8:Type>cfg:DocumentRef.РаспределениеНДС</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.ГТДИмпорт</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаПоступления</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыкупПредметовЛизинга</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОператораСистемыПлатон</v8:Type>
						<v8:Type>cfg:DocumentRef.АР_АктСнятияПоказанийСчетчика</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактураВыданный</v8:Type>
						<v8:Type>cfg:DocumentRef.ОприходованиеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеМатериаловИзЭксплуатации</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыдачаДенежныхДокументов</v8:Type>
						<v8:Type>cfg:DocumentRef.РегистрацияОплатыОсновныхСредствДляУСН</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаМатериаловВЭксплуатацию</v8:Type>
						<v8:Type>cfg:DocumentRef.ТаможеннаяДекларацияЭкспорт</v8:Type>
						<v8:Type>cfg:DocumentRef.ДокументРасчетовСКонтрагентом</v8:Type>
						<v8:Type>cfg:DocumentRef.АР_ПланированиеЗатратНаЭксплуатацию</v8:Type>
						<v8:Type>cfg:DocumentRef.ПринятиеКУчетуОС</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеНаРасчетныйСчет</v8:Type>
						<v8:Type>cfg:DocumentRef.АР_СчетНаАренду</v8:Type>
						<v8:Type>cfg:DocumentRef.ДепонированиеЗарплаты</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаРеализации</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеПеней</v8:Type>
						<v8:Type>cfg:DocumentRef.АР_ЗаявкаНаОбслуживание</v8:Type>
						<v8:Type>cfg:DocumentRef.АР_ВводПараметровЭксплуатацииОбъектов</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.АктСверкиВзаиморасчетов</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеДепонированнойЗарплаты</v8:Type>
						<v8:Type>cfg:DocumentRef.ОперацияБух</v8:Type>
						<v8:Type>cfg:DocumentRef.УдалитьНачислениеЗарплатыРаботникамОрганизаций</v8:Type>
						<v8:Type>cfg:DocumentRef.ПутевойЛист</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПоставщика</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаЗадолженностиНаФакторинг</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеДенежныхДокументов</v8:Type>
						<v8:Type>cfg:DocumentRef.АктОбОказанииПроизводственныхУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеНМА</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаДолга</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтражениеЗарплатыВУчете</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.АР_ВыполнениеРаботПоОбслуживанию</v8:Type>
						<v8:Type>cfg:DocumentRef.ОказаниеУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаОСВАренду</v8:Type>
						<v8:Type>cfg:DocumentRef.МодернизацияОС</v8:Type>
						<v8:Type>cfg:DocumentRef.ПереоценкаТоваровВРознице</v8:Type>
						<v8:Type>cfg:DocumentRef.АР_ИзменениеСтатусовОбъектов</v8:Type>
						<v8:Type>cfg:DocumentRef.ОперацияСБилетом</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПокупателю</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.АР_РасторжениеДоговораАренды</v8:Type>
						<v8:Type>cfg:DocumentRef.Отпуск</v8:Type>
						<v8:Type>cfg:DocumentRef.ОплатаПлатежнойКартой</v8:Type>
						<v8:Type>cfg:DocumentRef.УдалитьСписаниеДепонентовВДоходыОрганизаций</v8:Type>
						<v8:Type>cfg:DocumentRef.ТребованиеНакладная</v8:Type>
						<v8:Type>cfg:DocumentRef.БольничныйЛист</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионераОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеНДС</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитентуОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ПодготовкаКПередачеОС</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактураПолученный</v8:Type>
						<v8:Type>cfg:DocumentRef.АР_УстановкаЦенНаАренду</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводНачальныхОстатков</v8:Type>
						<v8:Type>cfg:DocumentRef.УдалитьДепонированиеОрганизаций</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаОборудованияВМонтаж</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаНМА</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеДивидендов</v8:Type>
						<v8:Type>cfg:DocumentRef.РегламентнаяОперация</v8:Type>
						<v8:Type>cfg:DocumentRef.ПерерасчетНДФЛ</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратОСОтАрендатора</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеВЛизинг</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходыПредпринимателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеИзПереработки</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеЗарплаты</v8:Type>
						<v8:Type>cfg:DocumentRef.ВосстановлениеНДС</v8:Type>
						<v8:Type>cfg:DocumentRef.ПодтверждениеНулевойСтавкиНДС</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаписьКнигиУчетаДоходовИРасходовИП</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявлениеОВвозеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.РегистрацияОплатыОсновныхСредствДляИП</v8:Type>
						<v8:Type>cfg:DocumentRef.РозничнаяПродажа</v8:Type>
						<v8:Type>cfg:DocumentRef.АР_НачислениеАренднойПлаты</v8:Type>
						<v8:Type>cfg:DocumentRef.АР_ЗаключениеДоговораАренды</v8:Type>
						<v8:Type>cfg:DocumentRef.ФормированиеЗаписейРаздела7ДекларацииНДС</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияУслугПоПереработке</v8:Type>
						<v8:Type>cfg:DocumentRef.ПодтверждениеОплатыНДСВБюджет</v8:Type>
						<v8:Type>cfg:DocumentRef.ФормированиеЗаписейКнигиПродаж</v8:Type>
						<v8:Type>cfg:DocumentRef.АР_НачислениеПени</v8:Type>
						<v8:Type>cfg:DocumentRef.КомплектацияНоменклатуры</v8:Type>
						<v8:Type>cfg:DocumentRef.УдалитьОтражениеЗарплатыВУчете</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнвентаризацияНЗП</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтражениеНачисленияНДС</v8:Type>
						<v8:Type>cfg:DocumentRef.АР_ПланируемыеПоступленияДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ПартияМатериаловВЭксплуатации</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтражениеНДСКВычету</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходыНаОнлайнКассыУменьшающиеНалоги</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнвентаризацияТоваровНаСкладе</v8:Type>
						<v8:Type>cfg:DocumentRef.УдалитьРасчетЕСН</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияОтгруженныхТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаписьКУДиР</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратМатериаловИзЭксплуатации</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеНДСпоСМРхозспособом</v8:Type>
						<v8:Type>cfg:DocumentRef.ВосстановлениеНДСПоОбъектамНедвижимости</v8:Type>
						<v8:Type>cfg:DocumentRef.АР_ЗакрытиеЗаявкиНаОбслуживание</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеОС</v8:Type>
						<v8:Type>cfg:DocumentRef.АР_АктПриемаВозвратаАрендуемогоПомещения</v8:Type>
						<v8:Type>cfg:DocumentRef.Партия</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеДопРасходов</v8:Type>
						<v8:Type>cfg:DocumentRef.ПринятиеКУчетуНМА</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеНМА</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.АР_АктПриемаПередачиПомещенияВАренду</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Reports/РасшифровкаПлатежейВБюджет/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьПараметрыИсполненияОтчета() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ИспользоватьВнешниеНаборыДанных",    Истина);
	Результат.Вставить("ИспользоватьПередКомпоновкойМакета", Истина);
	Результат.Вставить("ИспользоватьПослеКомпоновкиМакета",  Ложь);
	Результат.Вставить("ИспользоватьПослеВыводаРезультата",  Истина);
	Результат.Вставить("ИспользоватьДанныеРасшифровки",      Истина);
	Результат.Вставить("ИспользоватьПриВыводеЗаголовка",     Ложь);
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьВнешниеНаборыДанных(ПараметрыОтчета, МакетКомпоновки) Экспорт
	
	ДанныеУплачено = НовыйВнешниеДанныеУплачено();
	
	Если ПараметрыОтчета.ВидОтчета = ВидыОтчета().ПлатежиУСН
		ИЛИ ПараметрыОтчета.ВидОтчета = ВидыОтчета().НачисленияПлатежиУСН Тогда
		
		ПлатежиУСН = УчетУСН.ДокументыУплатыНалогаЗаПериод(
			ПараметрыОтчета.Организация,
			ПараметрыОтчета.НачалоПериода,
			ПараметрыОтчета.КонецПериода);
		
		Если ПлатежиУСН <> Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ПлатежиУСН, ДанныеУплачено);
		КонецЕсли;
		
	ИначеЕсли ПараметрыОтчета.ВидОТчета = ВидыОтчета().СтраховыеВзносы Тогда
		
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(
			УплаченныеСтраховыеВзносы(ПараметрыОтчета),
			ДанныеУплачено);
	
	ИначеЕсли ЭтоОтчетПоТорговомуСбору(ПараметрыОтчета.ВидОтчета) Тогда
		
		ПлатежиТорговыйСбор = УчетУСН.ДокументыУплатыТорговогоСбора(
			ПараметрыОтчета.Организация,
			ПараметрыОтчета.НачалоПериода,
			ПараметрыОтчета.КонецПериода);
		
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ПлатежиТорговыйСбор, ДанныеУплачено);
		
	ИначеЕсли ЭтоОтчетПоНДФЛ(ПараметрыОтчета.ВидОтчета) Тогда
		
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(
			УчетНДФЛПредпринимателя.УплаченныйНалогЗаПериодПоДокументам(
				ПараметрыОтчета.Организация,
				ПараметрыОтчета.НачалоПериода,
				ПараметрыОтчета.КонецПериода),
			ДанныеУплачено);
		
	КонецЕсли;
	
	ЗаполнитьСодержаниеПлатежей(ДанныеУплачено);
	
	Возврат Новый Структура("Уплачено", ДанныеУплачено);
	
КонецФункции

// В процедуре можно доработать компоновщик перед выводом в отчет
// Изменения сохранены не будут
Процедура ПередКомпоновкойМакета(ПараметрыОтчета, Схема, КомпоновщикНастроек) Экспорт
	
	БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "Организация", ПараметрыОтчета.Организация);
	БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "НачалоПериода", ПараметрыОтчета.НачалоПериода);
	БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "КонецПериода", ПараметрыОтчета.КонецПериода);
	
	СчетаОплатыНалога = Новый Массив;
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СчетаОплатыНалога, БухгалтерскийУчетПовтИсп.СчетаВИерархии(ПланыСчетов.Хозрасчетный.Касса));
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СчетаОплатыНалога, БухгалтерскийУчетПовтИсп.СчетаВИерархии(ПланыСчетов.Хозрасчетный.РасчетныеСчета));
	
	БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "СчетаОплатыНалога", СчетаОплатыНалога);
	
	БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "СчетаНачисленияНалога",
		БухгалтерскийУчетПовтИсп.СчетаВИерархии(ПланыСчетов.Хозрасчетный.ЕНприУСН));
	БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "ВидыПлатежей",
		Перечисления.ВидыПлатежейВГосБюджет.ВидыНалоговыхПлатежей());
	
	СтруктураОтчета = КомпоновщикНастроек.Настройки.Структура;
	
	Если ЭтоОтчетПоНалогуУСН(ПараметрыОтчета.ВидОтчета) Тогда
		
		Если ВыводитьНачисленияУСН(ПараметрыОтчета.ВидОтчета) Тогда
			
			ГруппировкаНачислено = СтруктураОтчета.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
			ГруппировкаНачислено.Имя = "Документ начисления";
			ГруппировкаНачислено.Использование = Истина;
			
			Если ВыводитьНачисленияИПлатежиУСН(ПараметрыОтчета.ВидОтчета) Тогда
				// Выводим заголовок, если в отчете несколько таблиц.
				ЭлементЗаголовок = ГруппировкаНачислено.ПараметрыВывода.Элементы.Найти("Заголовок");
				ЭлементЗаголовок.Значение = НСтр("ru = 'Начислено'");
				ЭлементЗаголовок.Использование = Истина;
			КонецЕсли;
			
			ВыбранноеПоле      = ГруппировкаНачислено.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
			ВыбранноеПоле.Поле = Новый ПолеКомпоновкиДанных("ДокументНачисления");
			ВыбранноеПоле      = ГруппировкаНачислено.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
			ВыбранноеПоле.Поле = Новый ПолеКомпоновкиДанных("СуммаНачисления");
			
			ЭлементУО = ГруппировкаНачислено.УсловноеОформление.Элементы.Добавить();
			КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДокументНачисления");
			ЭлементУО.Оформление.УстановитьЗначениеПараметра("МинимальнаяШирина", 55);
			ЭлементУО.Оформление.УстановитьЗначениеПараметра("МаксимальнаяШирина", 55);
			
			ЭлементУО = ГруппировкаНачислено.УсловноеОформление.Элементы.Добавить();
			КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "СуммаНачисления");
			ЭлементУО.Оформление.УстановитьЗначениеПараметра("МинимальнаяШирина", 13);
			ЭлементУО.Оформление.УстановитьЗначениеПараметра("МаксимальнаяШирина", 13);
			
		КонецЕсли;
		
		Если ВыводитьПлатежиУСН(ПараметрыОтчета.ВидОтчета) Тогда
			
			ГруппировкаОплачено               = СтруктураОтчета.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
			ГруппировкаОплачено.Имя           = "Документ оплаты";
			ГруппировкаОплачено.Использование = Истина;
			
			Если ВыводитьНачисленияИПлатежиУСН(ПараметрыОтчета.ВидОтчета) Тогда
				// Выводим заголовок, если в отчете несколько таблиц.
				ЭлементЗаголовок = ГруппировкаОплачено.ПараметрыВывода.Элементы.Найти("Заголовок");
				ЭлементЗаголовок.Значение = НСтр("ru = 'Оплачено'");
				ЭлементЗаголовок.Использование = Истина;
			КонецЕсли;
			
			ВыбранноеПоле      = ГруппировкаОплачено.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
			ВыбранноеПоле.Поле = Новый ПолеКомпоновкиДанных("ДокументОплаты");
			ВыбранноеПоле      = ГруппировкаОплачено.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
			ВыбранноеПоле.Поле = Новый ПолеКомпоновкиДанных("СуммаОплаты");
			ВыбранноеПоле      = ГруппировкаОплачено.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
			
			ЭлементУО = ГруппировкаОплачено.УсловноеОформление.Элементы.Добавить();
			КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДокументОплаты");
			ЭлементУО.Оформление.УстановитьЗначениеПараметра("МинимальнаяШирина", 55);
			ЭлементУО.Оформление.УстановитьЗначениеПараметра("МаксимальнаяШирина", 55);
			
			ЭлементУО = ГруппировкаОплачено.УсловноеОформление.Элементы.Добавить();
			КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "СуммаОплаты");
			ЭлементУО.Оформление.УстановитьЗначениеПараметра("МинимальнаяШирина", 13);
			ЭлементУО.Оформление.УстановитьЗначениеПараметра("МаксимальнаяШирина", 13);
			
		КонецЕсли;
		
	ИначеЕсли ПараметрыОтчета.ВидОтчета = ВидыОтчета().СтраховыеВзносы
		Или ПараметрыОтчета.ВидОтчета = ВидыОтчета().ТорговыйСбор Тогда
		
		ДетальнаяГруппировка               = СтруктураОтчета.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
		ДетальнаяГруппировка.Имя           = "Детальная";
		ДетальнаяГруппировка.Использование = Истина;
		
		ВыбранноеПоле      = ДетальнаяГруппировка.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		ВыбранноеПоле.Поле = Новый ПолеКомпоновкиДанных("ДокументОплаты");
		ВыбранноеПоле      = ДетальнаяГруппировка.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		ВыбранноеПоле.Поле = Новый ПолеКомпоновкиДанных("Содержание");
		ВыбранноеПоле      = ДетальнаяГруппировка.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		ВыбранноеПоле.Поле = Новый ПолеКомпоновкиДанных("СуммаОплаты");

		ЭлементУО = ДетальнаяГруппировка.УсловноеОформление.Элементы.Добавить();
		КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДокументОплаты");
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("МаксимальнаяШирина", 30);
		
		ЭлементУО = ДетальнаяГруппировка.УсловноеОформление.Элементы.Добавить();
		КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Содержание");
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("МаксимальнаяШирина", 40);
		
		ЭлементУО = ДетальнаяГруппировка.УсловноеОформление.Элементы.Добавить();
		КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "СуммаОплаты");
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("МинимальнаяШирина", 13);
		
	ИначеЕсли ЭтоОтчетПоНДФЛ(ПараметрыОтчета.ВидОтчета) Тогда
		
		Если ПараметрыОтчета.ВидОтчета = ВидыОтчета().НачисленияПлатежиНДФЛ Тогда
		
			БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "СчетаНачисленияНалога",
				БухгалтерскийУчетПовтИсп.СчетаВИерархии(ПланыСчетов.Хозрасчетный.НДФЛ_ИП));
			
			ГруппировкаНачислено = СтруктураОтчета.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
			ГруппировкаНачислено.Имя = "Документ начисления";
			ГруппировкаНачислено.Использование = Истина;
				
			// Выводим заголовок, если в отчете несколько таблиц.
			ЭлементЗаголовок = ГруппировкаНачислено.ПараметрыВывода.Элементы.Найти("Заголовок");
			ЭлементЗаголовок.Значение = НСтр("ru = 'Начислено'");
			ЭлементЗаголовок.Использование = Истина;
				
			ВыбранноеПоле      = ГруппировкаНачислено.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
			ВыбранноеПоле.Поле = Новый ПолеКомпоновкиДанных("ДокументНачисления");
			ВыбранноеПоле      = ГруппировкаНачислено.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
			ВыбранноеПоле.Поле = Новый ПолеКомпоновкиДанных("СуммаНачисления");
			
			ЭлементУО = ГруппировкаНачислено.УсловноеОформление.Элементы.Добавить();
			КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДокументНачисления");
			ЭлементУО.Оформление.УстановитьЗначениеПараметра("МинимальнаяШирина", 55);
			ЭлементУО.Оформление.УстановитьЗначениеПараметра("МаксимальнаяШирина", 55);
			
			ЭлементУО = ГруппировкаНачислено.УсловноеОформление.Элементы.Добавить();
			КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "СуммаНачисления");
			ЭлементУО.Оформление.УстановитьЗначениеПараметра("МинимальнаяШирина", 13);
			ЭлементУО.Оформление.УстановитьЗначениеПараметра("МаксимальнаяШирина", 13);
			
		КонецЕсли;
		
		Если ПараметрыОтчета.ВидОтчета = ВидыОтчета().ПлатежиНДФЛ
			Или ПараметрыОтчета.ВидОтчета = ВидыОтчета().НачисленияПлатежиНДФЛ Тогда
		
			ГруппировкаОплачено               = СтруктураОтчета.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
			ГруппировкаОплачено.Имя           = "Документ оплаты";
			ГруппировкаОплачено.Использование = Истина;
			
			ЭлементЗаголовок = ГруппировкаОплачено.ПараметрыВывода.Элементы.Найти("Заголовок");
			ЭлементЗаголовок.Значение = НСтр("ru = 'Оплачено'");
			ЭлементЗаголовок.Использование = Истина;
			
			ВыбранноеПоле      = ГруппировкаОплачено.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
			ВыбранноеПоле.Поле = Новый ПолеКомпоновкиДанных("ДокументОплаты");
			ВыбранноеПоле      = ГруппировкаОплачено.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
			ВыбранноеПоле.Поле = Новый ПолеКомпоновкиДанных("СуммаОплаты");
			ВыбранноеПоле      = ГруппировкаОплачено.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
			
			ЭлементУО = ГруппировкаОплачено.УсловноеОформление.Элементы.Добавить();
			КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДокументОплаты");
			ЭлементУО.Оформление.УстановитьЗначениеПараметра("МинимальнаяШирина", 55);
			ЭлементУО.Оформление.УстановитьЗначениеПараметра("МаксимальнаяШирина", 55);
			
			ЭлементУО = ГруппировкаОплачено.УсловноеОформление.Элементы.Добавить();
			КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "СуммаОплаты");
			ЭлементУО.Оформление.УстановитьЗначениеПараметра("МинимальнаяШирина", 13);
			ЭлементУО.Оформление.УстановитьЗначениеПараметра("МаксимальнаяШирина", 13);
			
		КонецЕсли;
		
	КонецЕсли;
	
	КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("ВыводитьЗаголовок", Ложь);
	КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("ВыводитьПодвал"   , Ложь);
	
КонецПроцедуры

Процедура ПослеВыводаРезультата(ПараметрыОтчета, Результат) Экспорт
	
	БухгалтерскиеОтчетыВызовСервера.ОбработкаРезультатаОтчета(ПараметрыОтчета.ИдентификаторОтчета, Результат);
	
	Результат.ФиксацияСверху = 0;
	
	Результат.ФиксацияСлева = 0;
	
КонецПроцедуры

Функция ВидыОтчета() Экспорт
	
	ПоддерживаемыеВидыОтчета = Новый Структура;
	
	ПоддерживаемыеВидыОтчета.Вставить("НачисленияУСН",        "НачисленияУСН");
	ПоддерживаемыеВидыОтчета.Вставить("ПлатежиУСН",           "ПлатежиУСН");
	ПоддерживаемыеВидыОтчета.Вставить("НачисленияПлатежиУСН", "НачисленияПлатежиУСН");
	ПоддерживаемыеВидыОтчета.Вставить("СтраховыеВзносы",      "СтраховыеВзносы");
	ПоддерживаемыеВидыОтчета.Вставить("ТорговыйСбор",         "ТорговыйСбор");
	ПоддерживаемыеВидыОтчета.Вставить("НачисленияПлатежиНДФЛ","НачисленияПлатежиНДФЛ");
	ПоддерживаемыеВидыОтчета.Вставить("ПлатежиНДФЛ",          "ПлатежиНДФЛ");
	
	Возврат ПоддерживаемыеВидыОтчета;
	
КонецФункции

Функция ЭтоОтчетПоНалогуУСН(ВидОтчета) Экспорт
	
	ВсеВидыОтчета = ВидыОтчета();
	
	Возврат ВидОтчета = ВсеВидыОтчета.НачисленияПлатежиУСН
		Или ВидОтчета = ВсеВидыОтчета.НачисленияУСН
		Или ВидОтчета = ВсеВидыОтчета.ПлатежиУСН;
	
КонецФункции

Функция ЭтоОтчетПоНДФЛ(ВидОтчета) Экспорт
	
	ВсеВидыОтчета = ВидыОтчета();
	
	Возврат ВидОтчета = ВсеВидыОтчета.НачисленияПлатежиНДФЛ
		Или ВидОтчета = ВсеВидыОтчета.ПлатежиНДФЛ;
	
КонецФункции

Функция ЭтоОтчетПоТорговомуСбору(ВидОтчета) Экспорт
	
	Возврат ВидОтчета = ВидыОтчета().ТорговыйСбор;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция УплаченныеСтраховыеВзносы(ПараметрыОтчета)
	
	СчетаДенежныхСредств = Новый Массив;
	СчетаДенежныхСредств.Добавить(ПланыСчетов.Хозрасчетный.КассаОрганизации); //50.01
	СчетаДенежныхСредств.Добавить(ПланыСчетов.Хозрасчетный.РасчетныеСчета);   //51
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("НачалоПериода", ПараметрыОтчета.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", ПараметрыОтчета.КонецПериода);
	Запрос.УстановитьПараметр("Организация", ПараметрыОтчета.Организация);
	
	Запрос.УстановитьПараметр("СчетаДенежныхСредств",
		БухгалтерскийУчет.СформироватьМассивСубсчетов(СчетаДенежныхСредств));
	Запрос.УстановитьПараметр("СчетаУчетаВзносов",
		УчетРасходовУменьшающихОтдельныеНалоги.СчетаСтраховыхВзносовУменьшающихНалог());
	Запрос.УстановитьПараметр("ВидыПлатежей", Перечисления.ВидыПлатежейВГосБюджет.ВидыНалоговыхПлатежей());
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ХозрасчетныйОборотыДтКт.Регистратор КАК ДокументОплаты,
	|	ХозрасчетныйОборотыДтКт.СуммаОборот КАК СуммаОборот,
	|	ХозрасчетныйОборотыДтКт.СубконтоДт1 КАК ВидПлатежа,
	|	ХозрасчетныйОборотыДтКт.СчетДт КАК СчетУчета,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ХозрасчетныйОборотыДтКт.Регистратор) = ТИП(Документ.СписаниеСРасчетногоСчета)
	|			ТОГДА ВЫРАЗИТЬ(ХозрасчетныйОборотыДтКт.Регистратор КАК Документ.СписаниеСРасчетногоСчета).НалоговыйПериод
	|		КОГДА ТИПЗНАЧЕНИЯ(ХозрасчетныйОборотыДтКт.Регистратор) = ТИП(Документ.РасходныйКассовыйОрдер)
	|			ТОГДА ВЫРАЗИТЬ(ХозрасчетныйОборотыДтКт.Регистратор КАК Документ.РасходныйКассовыйОрдер).НалоговыйПериод
	|		ИНАЧЕ ХозрасчетныйОборотыДтКт.Период
	|	КОНЕЦ КАК СтраховойПериод
	|ПОМЕСТИТЬ ВТ_Выписки
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Регистратор,
	|			СчетДт В (&СчетаУчетаВзносов),
	|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ВидыПлатежейВГосБюджет),
	|			СчетКт В (&СчетаДенежныхСредств),
	|			,
	|			Организация = &Организация
	|				И СубконтоДт1 В (&ВидыПлатежей)) КАК ХозрасчетныйОборотыДтКт
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументОплаты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПлатежноеПоручение.Ссылка КАК Ссылка,
	|	ПлатежноеПоручение.СуммаДокумента КАК СуммаДокумента,
	|	ПлатежноеПоручение.ДокументОснование КАК ДокументОснование
	|ПОМЕСТИТЬ ВТ_Платежки
	|ИЗ
	|	Документ.ПлатежноеПоручение КАК ПлатежноеПоручение
	|ГДЕ
	|	ПлатежноеПоручение.Организация = &Организация
	|	И ПлатежноеПоручение.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И НЕ ПлатежноеПоручение.ПометкаУдаления
	|	И ПлатежноеПоручение.ПеречислениеВБюджет
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументОснование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ВТ_Платежки.Ссылка, ВТ_Выписки.ДокументОплаты) КАК ДокументОплаты,
	|	ВТ_Выписки.СуммаОборот КАК СуммаОплаты,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(ВТ_Выписки.ДокументОплаты КАК Документ.СписаниеСРасчетногоСчета).ДатаВходящегоДокумента = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ВЫРАЗИТЬ(ВТ_Выписки.ДокументОплаты КАК Документ.СписаниеСРасчетногоСчета).Дата
	|		ИНАЧЕ ВЫРАЗИТЬ(ВТ_Выписки.ДокументОплаты КАК Документ.СписаниеСРасчетногоСчета).ДатаВходящегоДокумента
	|	КОНЕЦ КАК ДатаДокумента,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(ВТ_Выписки.ДокументОплаты КАК Документ.СписаниеСРасчетногоСчета).НомерВходящегоДокумента ПОДОБНО ""%[^ ]%""
	|			ТОГДА ВЫРАЗИТЬ(ВТ_Выписки.ДокументОплаты КАК Документ.СписаниеСРасчетногоСчета).НомерВходящегоДокумента
	|		ИНАЧЕ ВЫРАЗИТЬ(ВТ_Выписки.ДокументОплаты КАК Документ.СписаниеСРасчетногоСчета).Номер
	|	КОНЕЦ КАК НомерДокумента,
	|	ВТ_Выписки.СчетУчета КАК СчетУчета,
	|	ВТ_Выписки.ВидПлатежа КАК ВидПлатежа,
	|	ВТ_Выписки.СтраховойПериод КАК НалоговыйПериод
	|ИЗ
	|	ВТ_Выписки КАК ВТ_Выписки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Платежки КАК ВТ_Платежки
	|		ПО (ВТ_Платежки.Ссылка = ВТ_Выписки.ДокументОплаты.ДокументОснование
	|				ИЛИ ВТ_Выписки.ДокументОплаты = ВТ_Платежки.ДокументОснование)
	|ГДЕ
	|	ВТ_Выписки.ДокументОплаты ССЫЛКА Документ.СписаниеСРасчетногоСчета
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_Выписки.ДокументОплаты,
	|	ВТ_Выписки.СуммаОборот,
	|	ДанныеПервичныхДокументов.Дата,
	|	ДанныеПервичныхДокументов.Номер,
	|	ВТ_Выписки.СчетУчета,
	|	ВТ_Выписки.ВидПлатежа,
	|	ВТ_Выписки.СтраховойПериод
	|ИЗ
	|	ВТ_Выписки КАК ВТ_Выписки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПервичныхДокументов КАК ДанныеПервичныхДокументов
	|		ПО ВТ_Выписки.ДокументОплаты = ДанныеПервичныхДокументов.Документ
	|			И (ДанныеПервичныхДокументов.Организация = &Организация)
	|ГДЕ
	|	ВТ_Выписки.ДокументОплаты ССЫЛКА Документ.РасходныйКассовыйОрдер
	|	И ВТ_Выписки.СуммаОборот > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_Выписки.ДокументОплаты,
	|	ВТ_Выписки.СуммаОборот,
	|	ДанныеПервичныхДокументов.Дата,
	|	ДанныеПервичныхДокументов.Номер,
	|	ВТ_Выписки.СчетУчета,
	|	ВТ_Выписки.ВидПлатежа,
	|	ВТ_Выписки.СтраховойПериод
	|ИЗ
	|	ВТ_Выписки КАК ВТ_Выписки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПервичныхДокументов КАК ДанныеПервичныхДокументов
	|		ПО ВТ_Выписки.ДокументОплаты = ДанныеПервичныхДокументов.Документ
	|			И (ДанныеПервичныхДокументов.Организация = &Организация)
	|ГДЕ
	|	ВТ_Выписки.ДокументОплаты ССЫЛКА Документ.ОперацияБух
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаДокумента"
	;
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Процедура ЗаполнитьСодержаниеПлатежей(Платежи)
	
	Если Платежи.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СчетаУчета = ОбщегоНазначения.ВыгрузитьКолонку(Платежи, "СчетУчета", Истина);
	НаименованияСчетов = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(СчетаУчета, "Наименование");
	
	СчетаСтраховыхВзносов
		= БухгалтерскийУчетПовтИсп.СчетаВИерархии(ПланыСчетов.Хозрасчетный.РасчетыПоСоциальномуСтрахованию);
	
	Для Каждого Платеж Из Платежи Цикл
		
		Если УчетСтраховыхВзносовИП.ЭтоСчетУчетаСтраховыхВзносовИП(Платеж.СчетУчета) Тогда
			
			Платеж.Содержание = УчетСтраховыхВзносовИП.СодержаниеОперацииУплатыВзносов(
				Платеж.СчетУчета,
				Платеж.ВидПлатежа,
				Платеж.НалоговыйПериод);
				
		ИначеЕсли СчетаСтраховыхВзносов.Найти(Платеж.СчетУчета) <> Неопределено Тогда
			
			Платеж.Содержание = СтрШаблон(НСтр("ru = '%1 за %2'"),
				НаименованияСчетов[Платеж.СчетУчета],
				Формат(Платеж.НалоговыйПериод, "ДФ='MMMM yyyy'"));
			
		ИначеЕсли Платеж.СчетУчета = ПланыСчетов.Хозрасчетный.ТорговыйСбор Тогда
			
			Платеж.Содержание = СтрШаблон(НСтр("ru = '%1 за %2'"),
				НаименованияСчетов[Платеж.СчетУчета],
				Формат(Платеж.НалоговыйПериод, "Л=ru_RU; ДФ='q ''квартал'' yyyy'"));
			
		Иначе
			
			Платеж.Содержание = НаименованияСчетов[Платеж.СчетУчета];
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция НовыйВнешниеДанныеУплачено()
	
	ДанныеУплачено = Новый ТаблицаЗначений;
	
	ДанныеУплачено.Колонки.Добавить("ДокументОплаты");
	ДанныеУплачено.Колонки.Добавить("СуммаОплаты");
	ДанныеУплачено.Колонки.Добавить("ДатаДокумента");
	ДанныеУплачено.Колонки.Добавить("НомерДокумента");
	ДанныеУплачено.Колонки.Добавить("СчетУчета");
	ДанныеУплачено.Колонки.Добавить("НалоговыйПериод");
	ДанныеУплачено.Колонки.Добавить("ВидПлатежа");
	ДанныеУплачено.Колонки.Добавить("Содержание");
	
	Возврат ДанныеУплачено;
	
КонецФункции

Функция ВыводитьНачисленияУСН(ВидОтчета)
	
	ВсеВидыОтчета = ВидыОтчета();
	
	Возврат ВидОтчета = ВсеВидыОтчета.НачисленияПлатежиУСН
		Или ВидОтчета = ВсеВидыОтчета.НачисленияУСН;
	
КонецФункции

Функция ВыводитьПлатежиУСН(ВидОтчета)
	
	ВсеВидыОтчета = ВидыОтчета();
	
	Возврат ВидОтчета = ВсеВидыОтчета.НачисленияПлатежиУСН
		Или ВидОтчета = ВсеВидыОтчета.ПлатежиУСН;
	
КонецФункции

Функция ВыводитьНачисленияИПлатежиУСН(ВидОтчета)
	
	ВсеВидыОтчета = ВидыОтчета();
	
	Возврат ВидОтчета = ВсеВидыОтчета.НачисленияПлатежиУСН;
	
КонецФункции

#КонецОбласти

#КонецЕсли
